Repository: codejaron/NotchPilot
Catalog: Sources/NotchPilotKit/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Action Needed
zh_hans: 需要操作

source: Actions
zh_hans: 操作

source: Application
zh_hans: 应用

source: Apply to Current Song
zh_hans: 应用到当前歌曲

source: Approval
zh_hans: 审批

source: Artist
zh_hans: 艺人

source: Avoid Duplicate Sounds
zh_hans: 避免重复提示音

# avoidDuplicateSoundsDetail
source: NotchPilot cannot directly change Claude or Codex system notification sounds. Open macOS Notifications settings, choose Claude or Codex, then turn off Play sound.
zh_hans: NotchPilot 不能直接修改 Claude / Codex 的系统通知声音。打开 macOS 通知设置后，请选择 Claude 或 Codex，并关闭「播放声音」。

# batteryThresholdTitle
source: Battery Trigger
zh_hans: 电量触发线

# claudeCodeMissingDetail
source: Install Claude Code first.
zh_hans: 请先安装 Claude Code。

# claudeWaitingApproval
source: Claude is waiting for approval
zh_hans: Claude 正在等待审批

source: Close
zh_hans: 关闭

# codexNeedsInput
source: Codex needs your input
zh_hans: Codex 需要你的输入

# codexTextInputFallback
source: No, tell Codex how to adjust
zh_hans: 否，请告知 Codex 如何调整

# commandApprovalSummary
source: Run the following command?
zh_hans: 是否运行以下命令？

source: Connection Status
zh_hans: 连接状态

# cpuThresholdTitle
source: CPU Trigger
zh_hans: CPU 触发线

# desktopLyricsCard
source: Desktop Bottom Lyrics Card
zh_hans: 桌面底部歌词卡片

# desktopLyricsCardDetail
source: Show the current and next lyric at the bottom of the active screen.
zh_hans: 在当前活跃屏幕底部显示当前歌词与下一句。

source: Block HTTP Lyrics Sources
zh_hans: 不使用 HTTP 歌词源

# blockHTTPLyricsSourcesDetail
source: When enabled, searches use HTTPS-only providers. Leave it off to include more lyric sources, some of which use HTTP.
zh_hans: 开启后只使用 HTTPS 歌词源；关闭时会使用更多歌词源，其中部分通过 HTTP 查询。

source: Devin Integration
zh_hans: Devin 集成

# devinIntegrationDetail
source: Devin Local reuses Claude Code's hook configuration, so no separate install is required. Complete the integration on the Claude tab first.
zh_hans: Devin Local 会复用 Claude Code 的 Hook 配置，因此无需单独安装。请先在「Claude」标签里完成集成。

# diskThresholdTitle
source: Disk Free Trigger
zh_hans: 磁盘剩余触发线

# displayApprovalSneakNotifications
source: Show Claude / Codex Approval Popups
zh_hans: 显示 Claude / Codex 审批弹窗

# displayApprovalSneakNotificationsDetail
source: When off, approval prompts will not pop up automatically. Running session previews (with timer) are still shown.
zh_hans: 关闭后审批不会主动弹出，但运行中的会话预览（含计时）仍会显示。

source: Enable Claude Plugin
zh_hans: 启用 Claude 插件

# enableClaudePluginDetail
source: When off, Claude hooks are ignored and Claude sessions are removed from Notch.
zh_hans: 关闭后不会处理 Claude Hook，也不会在 Notch 中显示 Claude 会话。

source: Enable Codex Plugin
zh_hans: 启用 Codex 插件

# enableCodexPluginDetail
source: When off, Codex Desktop sessions are not monitored and Codex is removed from Notch.
zh_hans: 关闭后不再监听 Codex Desktop 会话，也不会出现在 Notch。

source: Enable Devin Plugin
zh_hans: 启用 Devin 插件

# enableDevinPluginDetail
source: When off, Devin Local tool-use events are ignored and Devin sessions are removed from Notch.
zh_hans: 关闭后不会处理 Devin Local 的工具调用事件，也不会在 Notch 中显示 Devin 会话。

source: Enable Media Plugin
zh_hans: 启用媒体插件

# enableMediaPluginDetail
source: When off, playback state is not monitored and Media is removed from Notch.
zh_hans: 关闭后不再监听播放状态，也不会出现在 Notch。

source: Enable Sounds
zh_hans: 启用声音

# enableSoundsDetail
source: Play a sound when an AI task completes or asks for approval.
zh_hans: AI 任务完成或等待审批时播放声音。

source: Enable System Monitor Plugin
zh_hans: 启用系统监控插件

# enableSystemMonitorPluginDetail
source: When off, CPU, memory, network, and other metrics stop sampling and are removed from Notch.
zh_hans: 关闭后停止采样 CPU、内存、网络等指标，并从 Notch 中移除。

# fileChangeApprovalSummary
source: Apply the following edits?
zh_hans: 是否应用以下编辑？

source: Font Size
zh_hans: 字体大小

source: General
zh_hans: 通用

source: Hidden
zh_hans: 隐藏

# hideAllSneakPreviewsDetail
source: Hide running session and playback previews (including the timer). Approval popups are not affected by this setting.
zh_hans: 关闭运行中的会话与播放预览（含计时）。审批弹窗不受此设置影响。

# hideAllSneakPreviewsTitle
source: Hide All Previews
zh_hans: 隐藏所有预览

# hideAllSneaksMenu
source: Hide All Sneaks
zh_hans: 隐藏所有预览

source: Highlight Color
zh_hans: 高亮颜色

# highlightColorDetail
source: Progress fill color for lyrics.
zh_hans: 歌词进度填充颜色。

source: Idle
zh_hans: 空闲

source: Install Integration
zh_hans: 安装集成

source: Integration Status
zh_hans: 集成状态

source: Interface Language
zh_hans: 界面语言

# interfaceLanguageDetail
source: Switch the display language used by NotchPilot.
zh_hans: 切换 NotchPilot 的显示语言。

source: Language
zh_hans: 语言

source: Launch at Login
zh_hans: 开机自动启动

# launchAtLoginDetail
source: Automatically start NotchPilot when you log in to your Mac.
zh_hans: 登录到 Mac 时自动运行 NotchPilot。

source: Left Slot 1
zh_hans: 左侧槽位 1

source: Left Slot 2
zh_hans: 左侧槽位 2

# lyricsBoundTo
source: Bound To
zh_hans: 绑定到

# lyricsOffsetLabel
source: Lyrics Offset:
zh_hans: 歌词偏移:

source: Lyrics Style
zh_hans: 歌词样式

# markLyricsWrongMenu
source: Mark Current Lyrics as Wrong
zh_hans: 标记当前歌词错误

source: Media
zh_hans: 媒体

# memoryThresholdTitle
source: Memory Trigger
zh_hans: 内存触发线

# missingClaudeBridgeScriptError
source: The script required for Claude integration was not found, so installation cannot continue.
zh_hans: 未找到 Claude 集成所需脚本，无法完成安装。

source: Network Access
zh_hans: 网络访问

source: Network access request
zh_hans: 网络访问请求

# networkThresholdTitle
source: Network Spike Trigger
zh_hans: 网络突发触发线

source: No active media playback.
zh_hans: 没有正在播放的媒体。

source: No lyrics found.
zh_hans: 没有找到可用歌词。

# noLyricsPreview
source: No lyrics available to preview.
zh_hans: 没有可预览的歌词。

source: No plugins enabled.
zh_hans: 没有启用插件。

source: No, tell Claude why
zh_hans: 否，告诉 Claude 原因

source: Open Notification Settings
zh_hans: 打开通知设置

source: Open Settings
zh_hans: 打开设置

source: Pinned Slots
zh_hans: 常驻槽位

# pinnedSlotsFooter
source: Pinned slots are hidden when the preview mode is set to Only on Alert.
zh_hans: 「仅异常时显示」模式下不会展示这些槽位。

source: Playback
zh_hans: 播放

source: Playback progress
zh_hans: 播放进度

source: Plugin
zh_hans: 插件

source: Preview
zh_hans: 预览

# quitAppButton
source: Quit App
zh_hans: 退出应用

# quitAppDetail
source: Close NotchPilot
zh_hans: 结束 NotchPilot

# quitAppTitle
source: Quit App
zh_hans: 退出应用

# quitNotchPilotMenu
source: Quit NotchPilot
zh_hans: 退出 NotchPilot

source: Reactive Metrics
zh_hans: 反应式指标

# reactiveMetricsDetail
source: Enabled pinned metrics change color in place; enabled unpinned metrics pop out on alert.
zh_hans: 勾选常驻指标会在阈值越界时原地变色；勾选非常驻指标会在异常时冒出。

# reactiveMetricsFooter
source: Pinned metrics do not pop out again; this switch only controls whether they tint on alert.
zh_hans: 常驻指标不会重复冒出，只受这里的开关控制是否变色。

source: Reactive Thresholds
zh_hans: 反应阈值

# reactiveThresholdsFooter
source: Thresholds only decide when an alert fires; tinting or popout is controlled by Reactive Metrics.
zh_hans: 阈值只决定什么时候触发异常；是否变色或冒出由反应式指标开关决定。

source: Remove Integration
zh_hans: 移除集成

# revealLyricsCacheMenu
source: Reveal Lyrics Cache in Finder
zh_hans: 在 Finder 中显示歌词缓存

source: Right Slot 1
zh_hans: 右侧槽位 1

source: Right Slot 2
zh_hans: 右侧槽位 2

source: Search
zh_hans: 搜索

# searchLyricsMenu
source: Search Lyrics…
zh_hans: 搜索歌词…

# searchLyricsWindowTitle
source: Search Lyrics
zh_hans: 搜索歌词

source: Searching…
zh_hans: 搜索中…

source: Send
zh_hans: 发送

# settingsMenu
source: Settings…
zh_hans: 设置…

# settingsWindowTitle
source: NotchPilot Settings
zh_hans: NotchPilot 设置

# showPlaybackPreview
source: Show Preview on Playback Changes
zh_hans: 播放变化时显示预览

# showPlaybackPreviewDetail
source: Show the current playback information while Notch is closed.
zh_hans: 在 Notch 闭合态显示当前播放信息。

# showSystemMonitorPreview
source: Show System Monitor while Notch is Closed
zh_hans: 在 Notch 闭合态显示系统监控

source: Skip
zh_hans: 跳过

# sneakPreviewMode
source: Preview Mode
zh_hans: 预览模式

# sneakPreviewModeAlwaysOn
source: Pinned Only
zh_hans: 仅常驻

# sneakPreviewModeAmbient
source: Only on Alert
zh_hans: 仅异常时显示

# sneakPreviewModeDetail
source: Pinned Only never adds extra metrics; Pinned + Alert Popout temporarily shows unpinned alerting metrics.
zh_hans: 仅常驻不会加入额外指标；常驻 + 异常冒出会把非常驻异常指标临时放进 sneak。

# sneakPreviewModePinnedReactive
source: Pinned + Alert Popout
zh_hans: 常驻 + 异常冒出

source: Sneak Previews
zh_hans: 刘海预览

source: Song
zh_hans: 歌曲

source: Sound Feedback
zh_hans: 声音反馈

# soundInputRequiredVolume
source: Approval Request Volume
zh_hans: 等待审批音量

# soundInputRequiredVolumeDetail
source: Volume of the cue played when AI asks for approval or input.
zh_hans: 调整 AI 请求审批或输入时提示音的音量。

# soundTaskCompleteVolume
source: Task Complete Volume
zh_hans: 任务完成音量

# soundTaskCompleteVolumeDetail
source: Volume of the cue played when an AI task finishes.
zh_hans: 调整 AI 任务完成时提示音的音量。

source: Source
zh_hans: 来源

source: Startup
zh_hans: 启动

source: Stop session detection
zh_hans: 停止会话检测

source: Submit
zh_hans: 提交

source: System
zh_hans: 系统

source: Tell Claude what to change
zh_hans: 告诉 Claude 要修改什么

# temperatureThresholdTitle
source: Temperature Trigger
zh_hans: 温度触发线

# toggleHideAllPreviewsShortcutDetail
source: Global shortcut, also shown in the menu bar item. Click the field on the right to record; press Delete to clear.
zh_hans: 全局快捷键，菜单栏菜单同步显示。点击右侧方框开始录制，按下 Delete 清除。

# toggleHideAllPreviewsShortcutTitle
source: "Hide All Previews" Shortcut
zh_hans: 切换"隐藏所有预览"快捷键

source: Type here
zh_hans: 在此输入

# unableToLoadLyrics
source: Unable to load the selected lyrics.
zh_hans: 无法加载所选歌词。

source: Unknown Track
zh_hans: 未知曲目

source: Update Integration
zh_hans: 更新集成
